load-tests/results/high-traffic-p95fix-tier1-500x500/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/load-tests/k6/high-traffic-500vu-10000.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 10m30s max duration (incl. graceful stop):
              * high_traffic_booking: 500 iterations shared among 500 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]


  █ TOTAL RESULTS 

    checks_total.......: 1000    393.696846/s
    checks_succeeded...: 100.00% 1000 out of 1000
    checks_failed......: 0.00%   0 out of 1000

    ✓ reservation response has an id
    ✓ reservation response is pending

    CUSTOM
    cancellations_succeeded............: 0      0/s
    errors_idempotency_in_progress.....: 0      0/s
    errors_rate_limited................: 0      0/s
    errors_sold_out....................: 0      0/s
    errors_user_limit..................: 0      0/s
    reservation_server_faults..........: 0      0/s
    reservation_unexpected_responses...: 0      0/s
    reservations_accepted..............: 500    196.848423/s
    reservations_created...............: 500    196.848423/s
    reservations_replayed..............: 0      0/s
    reserve_latency....................: avg=400.11ms min=188.19ms med=398.33ms p(90)=478.4ms  p(95)=492.94ms p(99)=501.68ms max=504.61ms

    HTTP
    http_req_duration..................: avg=401.47ms min=188.19ms med=398.35ms p(90)=478.93ms p(95)=493.13ms p(99)=503.36ms max=882.85ms
      { expected_response:true }.......: avg=401.47ms min=188.19ms med=398.35ms p(90)=478.93ms p(95)=493.13ms p(99)=503.36ms max=882.85ms
    http_req_failed....................: 0.00%  0 out of 503
    http_reqs..........................: 503    198.029514/s

    EXECUTION
    iteration_duration.................: avg=454.76ms min=206.64ms med=459.46ms p(90)=531.39ms p(95)=541.64ms p(99)=548.02ms max=556.71ms
    iterations.........................: 500    196.848423/s
    vus................................: 0      min=0        max=0  
    vus_max............................: 500    min=500      max=500

    NETWORK
    data_received......................: 386 kB 152 kB/s
    data_sent..........................: 290 kB 114 kB/s



running (00m02.5s), 000/500 VUs, 500 complete and 0 interrupted iterations
high_traffic_booking ✓ [ 100% ] 500 VUs  00m00.7s/10m0s  500/500 shared iters